## dev: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| add      | `aws_quicksight_refresh_schedule.sms-usage-notifications` |
| update   | `aws_iam_policy.quicksight_vpc_connection_iam`            |
|          | `aws_quicksight_account_subscription.subscription`        |
|          | `aws_s3_object.manifest_file`                             |
| recreate | `aws_cloudformation_stack.sms-usage-notifications`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudformation_stack.sms-usage-notifications is tainted, so must be replaced
-/+ resource "aws_cloudformation_stack" "sms-usage-notifications" {
      - disable_rollback   = false -> null
      ~ id                 = "arn:aws:cloudformation:ca-central-1:800095993820:stack/sms-usage-notifications/e83fcde0-6b86-11ef-a6ce-06126b4f0b99" -> (known after apply)
        name               = "sms-usage-notifications"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ notification_arns  = (sensitive value)
      ~ outputs            = {} -> (known after apply)
      ~ parameters         = {} -> (known after apply)
      + policy_body        = (known after apply)
      - tags               = {} -> null
      ~ tags_all           = {} -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ template_body      = (sensitive value)
      - timeout_in_minutes = 0 -> null
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.quicksight_vpc_connection_iam will be updated in-place
  ~ resource "aws_iam_policy" "quicksight_vpc_connection_iam" {
        id               = "arn:aws:iam::800095993820:policy/quicksight-vpc-connection-iam"
        name             = "quicksight-vpc-connection-iam"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy           = (sensitive value)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_quicksight_account_subscription.subscription will be updated in-place
  ~ resource "aws_quicksight_account_subscription" "subscription" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ account_name                     = (sensitive value)
        id                               = "800095993820"
        # (5 unchanged attributes hidden)
    }

  # aws_quicksight_refresh_schedule.sms-usage-notifications will be created
  + resource "aws_quicksight_refresh_schedule" "sms-usage-notifications" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "sms-usage-notifications"
      + id             = (known after apply)
      + schedule_id    = "schedule-sms-usage-notifications"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:45"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_s3_object.manifest_file will be updated in-place
  ~ resource "aws_s3_object" "manifest_file" {
      ~ etag                          = "b291abb04b84045e9fc38f3aca64c67c" -> "221f592f333f2fc284626cfdb8c4bc80"
        id                            = "quicksight/s3-manifest-sms-usage.json"
        tags                          = {}
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.template-category-history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

39 tests, 19 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
